<a href="https://colab.research.google.com/github/AshmithaMB/AutomatingSQLite3CRUD/blob/main/CRUD%2BSQLite3.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

## Integrating SQLite Database with Python and Performing CRUD Operations

#### Introduction
##### What Is SQLite?

* SQLite is a C-language library that implements a small, fast, self-contained, high-reliability, full-featured, SQL database engine. 

* A standalone command-line shell program called sqlite3 is provided in SQLite's distribution. 

* It can be used to create a database, define tables, insert and change rows, run queries and manage an SQLite database file.

* SQLite3 is a standardized Python DBI API 2.0 and provides a straightforward and simple-to-use interface for interacting with SQLite databases.

1. Importing the sqlite3 module in python

In [116]:
import sqlite3

2. Connection/ Creation

* Creating a new database 'students.db' and opening a database connection to allow sqlite3 to work with it (as it does not exist, it will create a database with the name 'students.db')
* Calling sqlite3.connect() to create a connection to the database 'students.db' in the current working directory.

In [117]:
conn = sqlite3.connect('students.db')

* returned Connection object 'conn' represents the connection to the on-disk database

##### Storage
* An SQLite database is normally stored in a single ordinary disk file. However, in certain circumstances, the database might be stored in memory.

* The most common way to force an SQLite database to exist purely in memory is to open the database using the special filename ":memory:"

* When this is done, no disk file is opened. Instead, a new database is created purely in memory. 
* The database ceases to exist as soon as the database connection is closed.

To avoid the error ('*table alreay exists*') while practicing queries in the working directory, It is best to use 
**conn = sqlite3.connect(':memory:')**

3. Cursor

* In order to execute SQL statements and fetch results from SQL queries, calling conn.cursor() which inturn creats a cursor for the database 'students.db'

In [118]:
c = conn.cursor()

## CRUD Operations

#### CREATE
* Creating a database table  **'students'**  with columns for :-
* **first**  ( first name of the student ) , 
* **last**    ( last name of the student ) , 
* **age**    ( age of the student ) and
* **college**  ( The college they've graduated from )


* Although, I could just use column names in the table declaration without specifying the data type ( as it is optional in SQLite3 ),  I have listed the data types just beside the column name.

* Executing the CREATE TABLE statement by calling c.execute('...')

##### SQLite3 has only 5 data types;
- **NULL**      -  NULL value
- **INTEGER**   -  Whole number value
- **REAL**      -  Floating point value
- **TEXT**      -  Text string value
- **BLOB**      -  The value is a blob of data, stored exactly as it was input.

In [119]:
c.execute('''CREATE TABLE students (
  first text,
  last text,
  age integer,
  college text
  )''')

##### Insertion
* Inserting data into the table and using c.excute() to execute

In [120]:
c.execute('''INSERT INTO students VALUES 
('Ashmitha','Maduri',20,'Sai Sudhir'),
('Rahul','Jamdhade',21,'Plymouth'),
('Akshaya','Gollayala',22,'Sacred Heart'),
('Chirag','Sareen',22,'Amity')''')

* Using conn.commit() method to commit/save the changes (insertions) to the database 'students.db'

In [121]:
conn.commit()

In [122]:
c.execute('''INSERT INTO students VALUES 
('Mrinalini','Maduri',30,'Sai Sudhir'),
('Nikita','Jamdhade',23,'Sai Sudhir'),
('Krithin','Gollayala',21,'Howard'),
('Keerthi','Sareen',25,'Amity'),
('Ashutosh','Maduri',25,'Federation University'),
('Priyanka','Mohan',26,'Sai Sudhir'),
('Neha','Sai',21,'Howard'),
('Kiran','Sareen',25,'Howard'),
('Mouni','Thakur',20,'Sai Sudhir'),
('Harshadeep','Sandhu',27,'Narayana'),
('Aman','Kaur',28,'Howard'),
('Jaspreet','Kaur',25,'Narayana'),
('Avneet','Kaur',25,'Chaitanya'),
('Neeti','Mohan',20,'Chaitanya'),
('Jai','Sai',21,'Narayana'),
('Veena','Thakur',20,'Narayana')''')

conn.commit()

#### READ
* The following SQL statement selects "last" column where last = 'Maduri'   from the "students" table.

* From the "students" table, the names of the students whose last name is 'Maduri' are showed/retrieved here.

In [123]:
c.execute('SELECT * FROM students WHERE last = "Maduri" ')

* fetchall() method fetches all (or all remaining) rows of the above query result set and returns a list of tuples.
* If no more rows are available, it returns an empty list.

In [124]:
print(c.fetchall())

[('Ashmitha', 'Maduri', 20, 'Sai Sudhir'), ('Mrinalini', 'Maduri', 30, 'Sai Sudhir'), ('Ashutosh', 'Maduri', 25, 'Federation University')]

* When the **print(c.fetchall())** was executed first, it retrieved/showed 3 records of students having their last name as 'Maduri'
* Output :   ' Ashmitha Maduri ' , ' Ashutosh Maduri ' , ' Mrinalini Maduri '
* When executed for the second time, (print(c.fetchall())) it returned an empty list

#### UPDATE

In [125]:
c.execute(
          """ UPDATE students SET age = 22 
              WHERE first = 'Ashmitha' AND last = 'Maduri'    """)

conn.commit()

c.execute('SELECT * FROM students WHERE last = "Maduri" ')

print(c.fetchall())

[('Ashmitha', 'Maduri', 22, 'Sai Sudhir'), ('Mrinalini', 'Maduri', 30, 'Sai Sudhir'), ('Ashutosh', 'Maduri', 25, 'Federation University')]

In [126]:
c.execute(
          """ UPDATE students SET last = 'Harshit'
              WHERE first = 'Aman' AND age = 28    """)

conn.commit()

c.execute('SELECT * FROM students WHERE first = "Aman" ')

print(c.fetchall())

[('Aman', 'Harshit', 28, 'Howard')]

#### DELETE

In [127]:
c.execute("DELETE FROM students WHERE first = 'Priyanka' AND last = 'Mohan'")

conn.commit()

c.execute('SELECT * FROM students WHERE first = "Priyanka" ')

print(c.fetchall())

[]

In [128]:
c.execute("DELETE FROM students WHERE college = 'Howard' AND first = 'Neha'")

conn.commit()

c.execute('SELECT * FROM students WHERE first = "Neha" ')

print(c.fetchall())

[]

#### AUTOMATING CRUD

##### Creating a Student Class to later insert data into the table quickly and retrieve data according to the attributes

In [129]:
class Student():
  ''' A Sample Student Class'''
  def __init__(self, first, last, age, college):
    self.first = first
    self.last = last
    self.age = age
    self.college = college

Inserting data through creating instances for the Student class

In [130]:
student_1 = Student('Harshavardhan','Thakur',28,'Amity')
student_2 = Student('Ashwini','Singh',24,'Kasturba')
student_3 = Student('Rohini','Singh',32,'Kasturba')

In [131]:
print(student_1)

<__main__.Student object at 0x7f6efe8260d0>

These three students are mere Python objects, which are not inserted into the database yet.
* To insert these into the database, I am using 2 methods

**DB-API** 
* Python standard library does not come with an RDBMS interface, but there are many free third-party modules that lets Python programs access specific databases. 
* Such modules follow the Python Database API 2.0 standard which consists of standards to be followed by modules that have functionality for database connectivity with Python programs

* Question mark (?) is a DB API placeholder, it provides an SQL interface compliant with the DB-API 2.0 specification described 
* Best practice is to use placeholders instead of string formatting to bind Python with SQLite3

In [132]:
c.execute("INSERT INTO students VALUES (?, ?, ?, ?)", (student_1.first, student_1.last, student_1.age, student_1.college))
conn.commit()

In [133]:
c.execute("INSERT INTO students VALUES (?, ?, ?, ?)", (student_2.first, student_2.last, student_2.age, student_2.college))
conn.commit()

In [134]:
c.execute("INSERT INTO students VALUES (?, ?, ?, ?)", (student_3.first, student_3.last, student_3.age, student_3.college))
conn.commit()

##### Retrieve/SELECT 
* To search for a specific value whose place holder is a question mark(?) (which is a DB API placeholder), the argument should be witten in a tuple or else it throws an Error
* Hence why the comma after "Singh"  and  "Thakur" which are passed in a tuple

In [135]:
c.execute('   SELECT * FROM students WHERE last =?', ("Thakur",)        )
print(c.fetchall())

[('Mouni', 'Thakur', 20, 'Sai Sudhir'), ('Veena', 'Thakur', 20, 'Narayana'), ('Harshavardhan', 'Thakur', 28, 'Amity')]

#### Automating this with Python by adding on functions into the Student class created above to perform **CRUD operations**.

In [136]:
from typing_extensions import Self
class stu():

  ''' A Sample Student Class'''

# 'with conn:' - saves the changes to the table immediately



  def __init__(self, first, last, age, college):
    self.first = first
    self.last = last
    self.age = age
    self.college = college
    



  def insert(first, last, age, college):
    with conn:
      c.execute("INSERT INTO students VALUES (?, ?, ?, ?)", (first, last, age, college))




  def lastname(lastname):
    c.execute('SELECT * FROM students WHERE last =?', (lastname,))
    return c.fetchall()



  def update_age(age, f, l):
    with conn:
      c.execute(
          """ UPDATE students SET age = ? 
              WHERE first = ? AND last = ?   """,
          (age, f, l))
      


  def select(firstname, lastname):
    with conn:
      c.execute('SELECT * FROM students WHERE first = ? AND last =?', (firstname, lastname))
      return c.fetchall()



  def delete(first, last):
    with conn:
      c.execute("DELETE FROM students WHERE first = ? AND last = ?", (first, last))

In [137]:
stu.insert('Nikitha','Kulkarni',29,'Andrews')

In [138]:
stu.select('Nikitha','Kulkarni')

[('Nikitha', 'Kulkarni', 29, 'Andrews')]

In [139]:
stu.update_age(100,'Ashmitha', 'Maduri')

In [140]:
stu.select('Ashmitha', 'Maduri')

[('Ashmitha', 'Maduri', 100, 'Sai Sudhir')]

In [141]:
stu.delete('Nikitha', 'Kulkarni')

In [142]:
stu.select('Nikitha','Kulkarni')

[]

In [143]:
stu.insert('Akshay','Iyer',300, 'Lambton')

In [144]:
stu.select('Akshay','Iyer')

[('Akshay', 'Iyer', 300, 'Lambton')]

In [145]:
stu.update_age(25,'Akshay','Iyer')

In [146]:
stu.select('Akshay','Iyer')

[('Akshay', 'Iyer', 25, 'Lambton')]

In [147]:
stu.delete('Akshay','Iyer')

In [148]:
stu.select('Akshay','Iyer')

[]